#ifndef  __INC_ACI_slave_H__
#define  __INC_ACI_slave_H__
//------------------------------------------------------------------------------
// includes
//------------------------------------------------------------------------------
#include <stdint.h>
//------------------------------------------------------------------------------
// check for correct compilation options
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// const defines
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// typedef
//------------------------------------------------------------------------------
typedef struct 
{
	uint8_t		Address;		//地址			0,1
	uint8_t		Type;			//类型			1,1
	uint8_t		Status;		//节点状态+节点报警			2,1
	//高四位为节点报警信息，第四位代表节点状态
	//D0代表电机是否启动，1启动，0关闭；
	//D4代表过压保护，0为正常，1为过压；
	uint8_t		CMD;		//节点命令			3,1
	//D0代表电机是否启动，1启动，0关闭；
	uint16_t		FLOW1;			//标况流量		4,2    小电机单位是0.001L/min,大电机是0.1L/min
	uint16_t		FLOW2;			//工况流量			6,2
	uint16_t		FLOW3;	//工况目标流量	8,2
	uint16_t		Q0;			//大气压力			10,2
	uint16_t		Q1;			//计前压力			12,2
	uint16_t		Q2;			//差压		14,2
	uint16_t		Q3;			//设置压力保护点--计前压力			16,2
	uint16_t		Temp;		//计前温度		18,2
	int16_t		PWM;		//PWM值			20,2
	
	int16_t		FLOW2_K1;		//工况流量倍率	22,2 
	int16_t		FLOW2_K2;		//工况流量倍率	24,2
	int16_t		FLOW2_K3;		//工况流量倍率	26,2
	int16_t		FLOW2_K4;		//工况流量倍率	28,2
	int16_t		FLOW2_B;		//工况流量B值 	30,2	对于大气采集的单位为：0.001L/min,颗粒物的单位为：0.1L/min
	int16_t		Q1_K;			//计压倍率	32,2
	int16_t		Q1_B;		//计压B值 	34,2					单位为：Pa
	int16_t		Q2_K;			//差压倍率	36,2
	int16_t		Q2_B;			//差压B值 	38,2 =28		单位为：Pa
	int16_t		Temp_K;			//计前温度倍率	40,2
	int16_t		Temp_B;			//计前温度B值 	42,2 =28	单位为：0.1℃
	
	int16_t		SV[9];			//44,18
	uint8_t		LRC_NUM[2];					  //62,2 =58
}slave_sample_data_t;

//------------------------------------------------------------------------------
// global variable declarations
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// function prototypes
//------------------------------------------------------------------------------



#endif


